const prophecies = [
    "Ти знайдеш свою долю у найнеочікуваніший момент.",
    "Ти отримаєш велике благословення.",
    "На тебе чекає несподівана подорож.",
    "Будь уважний: доля готує тобі випробування.",
    "Ти зустрінеш людину, яка змінить твоє життя.",
    "Боги сприятимуть тобі в твоїх починаннях.",
    "Ти отримаєш несподівану звістку.",
    "Доля готує для тебе цікаву пригоду.",
    "Скоро здійсниться одна з твоїх мрій.",
    "Будь уважний: можливість вже поруч.",
    "Твої зусилля принесуть велику нагороду.",
    "Боги прихильні до тебе – але будь обережний з вибором друзів.",
    "Твоя подорож принесе великі зміни у життя.",
    "Справжня сила – в знаннях. Вчися, щоб досягти величі.",
    "Боги випробують тебе, але ти зможеш витримати будь-яке випробування."
  ];

const prophecyText = document.querySelector(".prophecy");

let isClicked = false

prophecyText.addEventListener("click", () => {
    if (!isClicked){
    const randomIndex = Math.floor(Math.random() * prophecies.length);
    prophecyText.innerText = prophecies[randomIndex];
    isClicked = true
    }
  });
